Autodesk.Revit.DB.ExportFontKey.OriginalFontName
The original font name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportFontKey.#ctor(System.String)
Constructs a new ExportFontKey using an input font name.
originalFontName:
The original font name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportFontKey.#ctor(Autodesk.Revit.DB.ExportFontKey)
Constructs a new copy of the input ExportFontKey object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014